{
    "很遗憾您这没有能用的显卡来支持您训练": "К сожалению, для вашего обучения не существует совместимого графического процессора.",
    "是": "Да",
    "step1:正在处理数据": "Шаг 1: Обработка данных",
    "step2a:无需提取音高": "Шаг 2а: Пропуск извлечения",
    "step2b:正在提取特征": "Шаг 2б: Извлечение функций",
    "step3a:正在训练模型": "Шаг 3а: Начало тренировки модели",
    "训练结束, 您可查看控制台训练日志或实验文件夹下的train.log": "Обучение завершено. Вы можете просмотреть журналы тренировок в консоли или в файле train.log в папке эксперимента.",
    "全流程结束！": "Все процессы завершены!",
    "本软件以MIT协议开源, 作者不对软件具备任何控制力, 使用软件者、传播软件导出的声音者自负全责. <br>如不认可该条款, 则不能使用或引用软件包内任何代码和文件. 详见根目录<b>使用需遵守的协议-LICENSE.txt</b>.": "Это программное обеспечение имеет открытый исходный код под лицензией MIT. Автор не имеет никакого контроля над программой. Ответственность несут только пользователи, которые используют программное обеспечение и распространяют звуки, экспортированные с помощью программного обеспечения. <br>Если вы не согласны с этим пунктом, вы не можете использовать или ссылаться на какие-либо коды и файлы в составе программного пакета. Подробности смотрите в корневом каталоге <b>Agreement-LICENSE.txt</b>.",
    "模型推理": "Вывод модели",
    "推理音色": "Вывод голоса:",
    "刷新音色列表和索引路径": "Обновить список голосов и путь к индексу.",
    "卸载音色省显存": "Выгрузите голос, чтобы сэкономить память ГП:",
    "请选择说话人id": "Выбери Спикера/Исполнителя ID:",
    "男转女推荐+12key, 女转男推荐-12key, 如果音域爆炸导致音色失真也可以自己调整到合适音域. ": "Рекомендуемый ключ +12 для преобразования мужчины в женщину и ключ -12 для преобразования женщины в мужчину. Если звуковой диапазон заходит слишком далеко и голос искажается, вы также можете самостоятельно настроить его на соответствующий диапазон.",
    "变调(整数, 半音数量, 升八度12降八度-12)": "Транспонирование (целое число, количество полутонов, повышение на октаву: 12, понижение на октаву: -12):",
    "输入待处理音频文件路径(默认是正确格式示例)": "Введите путь к аудиофайлу, который необходимо обработать (по умолчанию — правильный пример формата):",
    "选择音高提取算法,输入歌声可用pm提速,harvest低音好但巨慢无比,crepe效果好但吃GPU": "Выберите алгоритм извлечения высоты звука («pm»: более быстрое извлечение, но более низкое качество речи; «harvest»: лучшие басы, но очень медленные; «creepe»: лучшее качество, но интенсивное использование ГП):",
    "crepe_hop_length": "Длина creepe-hop (применяется только к creepe): длина прыжка означает время, необходимое говорящему, чтобы перейти на драматический тон. Для определения более низкой длины скачка требуется больше времени, но они более точны по высоте.",
    "特征检索库文件路径": "Путь к файлу базы данных поиска объектов",
    ">=3则使用对harvest音高识别的结果使用中值滤波，数值为滤波半径，使用可以削弱哑音": "Если больше или равно 3: применить медианную фильтрацию к результатам «harvest». Значение представляет собой радиус фильтра и может немного уменьшить одышку.",
    "特征检索库文件路径,为空则使用下拉的选择结果": "Путь к индекс-файлу вашей модели. Оставьте пустым, чтобы использовать выбранный результат из раскрывающегося списка.:",
    "自动检测index路径,下拉式选择(dropdown)": "Автоматическое определение пути к индексу и выбор из раскрывающегося списка.:",
    "特征文件路径": "Путь к файлу объекта:",
    "检索特征占比": "Соотношение функций поиска:",
    "后处理重采样至最终采样率，0为不进行重采样": "Повторно дискретизируйте выходной звук при постобработке до окончательной частоты дискретизации. Установите значение 0, чтобы не выполнять повторную выборку.:",
    "输入源音量包络替换输出音量包络融合比例，越靠近1越使用输出包络": "Отрегулируйте масштабирование огибающей громкости. Чем ближе к 0, тем больше он имитирует громкость оригинального вокала. Может помочь замаскировать шум и сделать звучание вокала более естественным при низком уровне. Ближе к 1 будет более стабильно громкая громкость.:",
    "保护清辅音和呼吸声，防止电音撕裂等artifact，拉满0.5不开启，调低加大保护力度但可能降低索引效果": "Защищайте глухие согласные и звуки дыхания, чтобы предотвратить появление таких артефактов, как разрывы в электронной музыке. Установите значение 0,5, чтобы отключить. Уменьшите значение, чтобы повысить защиту, но это может снизить точность индексации.:",
    "F0曲线文件, 可选, 一行一个音高, 代替默认F0及升降调": "F0 файл кривой (необязательно). Один шаг на строку. Заменяет стандартную F0 и модуляцию высоты тона.:",
    "转换": "Конвертировать",
    "输出信息": "Выходная информация",
    "输出音频(右下角三个点,点了可以下载)": "Экспортируйте аудио (нажмите на три точки в правом нижнем углу, чтобы загрузить)",
    "批量转换, 输入待转换音频文件夹, 或上传多个音频文件, 在指定文件夹(默认opt)下输出转换的音频. ": "Пакетное преобразование. Введите папку, содержащую аудиофайлы, которые нужно преобразовать, или загрузите несколько аудиофайлов. Конвертированный звук будет выводиться в указанную папку (по умолчанию: «opt»).",
    "指定输出文件夹": "Укажите выходную папку:",
    "输入待处理音频文件夹路径(去文件管理器地址栏拷就行了)": "Введите путь к папке аудио, подлежащей обработке (скопируйте его из адресной строки файлового менеджера):",
    "也可批量输入音频文件, 二选一, 优先读文件夹": "Вы также можете вводить аудиофайлы в пакетном режиме. Выберите один из двух вариантов. Приоритет отдается чтению из папки.",
    "导出文件格式": "Формат файла экспорта",
    "伴奏人声分离&去混响&去回声": "Разделение вокала/музыки и удаление реверберации",
    "输入待处理音频文件夹路径": "Введите путь к аудиопапке, которую необходимо обработать.:",
    "模型": "Модель",
    "指定输出主人声文件夹": "Укажите выходную папку для вокала:",
    "指定输出非主人声文件夹": "Укажите выходную папку для музыки:",
    "训练": "Тренировка",
    "step1: 填写实验配置. 实验数据放在logs下, 每个实验一个文件夹, 需手工输入实验名路径, 内含实验配置, 日志, 训练得到的模型文件. ": "Шаг 1: Заполните экспериментальную конфигурацию. Экспериментальные данные хранятся в папке «logs», причем для каждого эксперимента имеется отдельная папка. Вручную введите путь к имени эксперимента, который содержит экспериментальную конфигурацию, журналы и файлы обученной модели.",
    "输入实验名": "Введите название эксперимента:",
    "目标采样率": "Целевая частота дискретизации:",
    "模型是否带音高指导(唱歌一定要, 语音可以不要)": "Имеет ли модель управление высотой тона (обязательно для пения, необязательно для речи):",
    "版本(目前仅40k支持了v2)": "Версия (в настоящее время поддерживается только v2 для частоты дискретизации 40к):",
    "提取音高和处理数据使用的CPU进程数": "Количество процессов ЦП, используемых для извлечения высоты звука и обработки данных:",
    "step2a: 自动遍历训练文件夹下所有可解码成音频的文件并进行切片归一化, 在实验目录下生成2个wav文件夹; 暂时只支持单人训练. ": "Шаг 2a. Автоматически просмотреть все файлы в папке обучения, которые можно декодировать в аудио, и выполнить нормализацию срезов. Создает 2 папки wav в каталоге эксперимента. В настоящее время поддерживается обучение только одного певца/спикера.",
    "输入训练文件夹路径": "Введите путь к папке обучения:",
    "请指定说话人id": "Пожалуйста, укажите ID спикера/певца:",
    "处理数据": "Обработка данных",
    "step2b: 使用CPU提取音高(如果模型带音高), 使用GPU提取特征(选择卡号)": "Шаг 2b. Используйте ЦП для извлечения шага (если у модели есть шаг), используйте графический процессор для извлечения функций (выберите индекс ГП).:",
    "以-分隔输入使用的卡号, 例如   0-1-2   使用卡0和卡1和卡2": "Введите индекс(ы) ГП, разделенные '-', e.g., 0-1-2 для использования ГП 0, 1, и 2:",
    "显卡信息": "Информация о ГП",
    "选择音高提取算法:输入歌声可用pm提速,高质量语音但CPU差可用dio提速,harvest质量更好但慢": "Выберите алгоритм извлечения высоты тона («pm»: более быстрое извлечение, но более низкое качество речи; «dio»: улучшенное извлечение речи, но более медленное извлечение; «harvest»: лучшее качество, но более медленное извлечение):",
    "特征提取": "Извлечение признаков",
    "step3: 填写训练设置, 开始训练模型和索引": "Шаг 3: Заполните настройки обучения и начните обучение модели и индекса.",
    "保存频率save_every_epoch": "Сохранения с частотой (save_every_epoch):",
    "总训练轮数total_epoch": "Количество тренированных эпох (total_epoch):",
    "每张显卡的batch_size": "Размер пакета на ГП:",
    "是否仅保存最新的ckpt文件以节省硬盘空间": "Сохранения последнего '.ckpt' файла для уменьшения занимаего места:",
    "否": "Нет",
    "是否缓存所有训练集至显存. 10min以下小数据可缓存以加速训练, 大数据缓存会炸显存也加不了多少速": "Кэшируйте все обучающие наборы в память ГП. Кэширование небольших наборов данных (менее 10 минут) может ускорить обучение, но кэширование больших наборов данных будет потреблять много памяти ГП и может не обеспечить значительного увеличения скорости.:",
    "是否在每次保存时间点将最终小模型保存至weights文件夹": "Сохраните небольшую окончательную модель в папку 'weights' для меньшего веса:",
    "加载预训练底模G路径": "Укажите путь к предварительно обученнуой базовой модели G:",
    "加载预训练底模D路径": "Укажите путь к предварительно обученнуой базовой модели D:",
    "训练模型": "Тренировка модели",
    "训练特征索引": "Тренировка индекса",
    "一键训练": "Тренировка в один клик",
    "ckpt处理": "обработка ckpt",
    "模型融合, 可用于测试音色融合": "Модель Fusion, можно использовать для проверки синтеза тембров.",
    "A模型路径": "Путь к модели A:",
    "B模型路径": "Путь к модели B:",
    "A模型权重": "Вес (w) для модели A:",
    "模型是否带音高指导": "Имеет ли модель наведение по тангажу:",
    "要置入的模型信息": "Информация о модели, которую необходимо разместить:",
    "保存的模型名不带后缀": "Saved model name (without extension):",
    "模型版本型号": "Версия архитектуры модели:",
    "融合": "Слияние",
    "修改模型信息(仅支持weights文件夹下提取的小模型文件)": "Изменить информацию о модели (поддерживается только для небольших файлов моделей, извлеченных из папки «weights»)",
    "模型路径": "Путь к модели:",
    "要改的模型信息": "Информация о модели, которую необходимо изменить:",
    "保存的文件名, 默认空为和源文件同名": "Имя файла сохранения (по умолчанию: такое же, как у исходного файла):",
    "修改": "Изменить",
    "查看模型信息(仅支持weights文件夹下提取的小模型文件)": "Просмотр информации о модели (поддерживается только для небольших файлов моделей, извлеченных из папки «weights»)",
    "查看": "Показать",
    "模型提取(输入logs文件夹下大文件模型路径),适用于训一半不想训了模型没有自动提取保存小文件模型,或者想测试中间模型的情况": "Model extraction (enter the path of the large file model under the 'logs' folder). This is useful if you want to stop training halfway and manually extract and save a small model file, or if you want to test an intermediate model:",
    "保存名": "Сохранить имя:",
    "模型是否带音高指导,1是0否": "Whether the model has pitch guidance (1: yes, 0: no):",
    "提取": "Извлечь",
    "Onnx导出": "Экспортировать Onnx",
    "RVC模型路径": "Путь к модели RVC:",
    "Onnx输出路径": "Путь для экспорта Onnx:",
    "MoeVS模型": "Модель MoeVS",
    "导出Onnx模型": "Экспортировать модель Onnx",
    "常见问题解答": "FAQ (Часто возникающие вопросы)",
    "招募音高曲线前端编辑器": "Приглашаем на работу фронтенд-редакторов для работы с питч-кривыми.",
    "加开发群联系我xxxxx": "Присоединяйтесь к группе разработчиков и свяжитесь со мной по телефону xxxxxx.",
    "点击查看交流、问题反馈群号": "Нажмите, чтобы просмотреть номер группы связи и обратной связи по проблемам.",
    "xxxxx": "xxxxx",
    "加载模型": "Загрузеть модель",
    "Hubert模型": "Модель Hubert",
    "选择.pth文件": "Выбрать файл .pth",
    "选择.index文件": "Выбрать файл .index",
    "选择.npy文件": "Выбрать файл .npy",
    "输入设备": "Устройство ввода",
    "输出设备": "Устройство вывода",
    "音频设备(请使用同种类驱动)": "Аудиоустройство (пожалуйста, используйте драйвер того же типа)",
    "响应阈值": "Порог ответа",
    "音调设置": "Настройки высоты тона",
    "Index Rate": "Ставка индекса",
    "常规设置": "Общие настройки",
    "采样长度": "Длина образца",
    "淡入淡出长度": "Длина затухания",
    "额外推理时长": "Дополнительное время вывода",
    "输入降噪": "Снижение входного шума",
    "输出降噪": "Снижение выходного шума",
    "性能设置": "Настройки производительности",
    "开始音频转换": "Начать преобразование аудио",
    "停止音频转换": "Закончить преобразование аудио",
    "推理时间(ms):": "Время вывода (мс):",
    "伴奏人声分离&去混响&去回声": "Разделение вокала и аккомпанемента, де-реверберация и де-эхо",
    "人声伴奏分离批量处理， 使用UVR5模型。": "Пакетная обработка разделения вокального аккомпанемента с использованием модели UVR5.",
    "合格的文件夹路径格式举例： E:\\codes\\py39\\vits_vc_gpu\\白鹭霜华测试样例(去文件管理器地址栏拷就行了)。": "Пример допустимого формата пути к папке: D:\\path\\to\\input\\folder (скопируйте его из адресной строки файлового менеджера).",
    "模型分为三类：": "Модель разделена на три категории.:",
    "1、保留人声：不带和声的音频选这个，对主人声保留比HP5更好。内置HP2和HP3两个模型，HP3可能轻微漏伴奏但对主人声保留比HP2稍微好一丁点；": "1. Сохранить вокал: выберите этот вариант для звука без гармоний. Он сохраняет вокал лучше, чем HP5. В него входят две встроенные модели: HP2 и HP3. HP3 может слегка пропускать аккомпанемент, но сохраняет вокал немного лучше, чем HP2.",
    "2、仅保留主人声：带和声的音频选这个，对主人声可能有削弱。内置HP5一个模型；": "2. Сохранять только основной вокал: выберите этот вариант для звука с гармониями. Это может ослабить основной вокал. Включает одну встроенную модель: HP5.",
    "3、去混响、去延迟模型（by FoxJoy）：": "3. Модели устранения реверберации и задержки (от FoxJoy):",
    "(1)MDX-Net:对于双通道混响是最好的选择，不能去除单通道混响；": "(1) MDX-Net: лучший выбор для удаления стереореверберации, но не может удалить монореверберацию.;",
    "(234)DeEcho:去除延迟效果。Aggressive比Normal去除得更彻底，DeReverb额外去除混响，可去除单声道混响，但是对高频重的板式混响去不干净。": "(234) DeEcho: Удаляет эффекты задержки. Агрессивный режим удаляет более тщательно, чем Нормальный режим. DeReverb дополнительно удаляет реверберацию и может удалять моно-реверберацию, но не очень эффективно для высокочастотного контента с сильной реверберацией..",
    "去混响/去延迟，附：": "Примечания по де-реверберации/де-дилэю:",
    "1、DeEcho-DeReverb模型的耗时是另外2个DeEcho模型的接近2倍；": "1. Время обработки модели DeEcho-DeReverb примерно в два раза больше, чем у двух других моделей DeEcho.",
    "2、MDX-Net-Dereverb模型挺慢的；": "2. Модель MDX-Net-Dereverb довольно медленная.",
    "3、个人推荐的最干净的配置是先MDX-Net再DeEcho-Aggressive。": "3. Рекомендуемая самая чистая конфигурация — сначала применить MDX-Net, а затем DeEcho-Aggressive."
}
